adafruit/Adafruit_nRF52_Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.softdevice=Softdevice
menu.version=Version
menu.lfclk=Low Frequency Clock
menu.board_variant=Board Variant

feather52.name=Feather52

feather52.vid.0=0x1366
feather52.pid.0=0x1015

#feather52.upload.tool=sandeepmistry:openocd
feather52.upload.tool=nrfutil
feather52.upload.protocol=nrfutil
feather52.upload.interface=serial
feather52.upload.target=nrf52
feather52.upload.maximum_size=174080
feather52.upload.use_1200bps_touch=false
feather52.upload.wait_for_upload_port=false
feather52.upload.native_usb=false

#feather52.bootloader.tool=sandeepmistry:openocd
feather52.bootloader.tool=nrfjprog

feather52.build.mcu=cortex-m4
feather52.build.f_cpu=16000000
feather52.build.board=FEATHER52
feather52.build.core=nRF5
feather52.build.variant=feather52
feather52.build.variant_system_lib=
feather52.build.extra_flags=-DNRF52
feather52.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
feather52.build.ldscript=nrf52_xxaa.ld

#feather52.menu.softdevice.none=None
#feather52.menu.softdevice.none.softdevice=none

feather52.menu.softdevice.s132=S132
feather52.menu.softdevice.s132.softdevice=s132
feather52.menu.softdevice.s132.softdeviceversion=2.0.1
feather52.menu.softdevice.s132.upload.maximum_size=409600
feather52.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
feather52.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

feather52.menu.lfclk.lfxo=Crystal Oscillator
feather52.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
feather52.menu.lfclk.lfrc=RC Oscillator
feather52.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
feather52.menu.lfclk.lfsynt=Synthesized
feather52.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

